<script setup lang="ts">
const emits = defineEmits(['FatherClick'])
const handelClick = () => {
  emits('FatherClick')
}
</script>

<template>
  <div class="accountPmc_Card accountPmc_Card_row animate__animated animate__pulse">
    <div
      class="accountPmc_Card_P accountPmc_Card_P_Hideout setup_button_height"
      style="
        display: flex;
        justify-content: center;
        align-items: center;
        margin-bottom: 2px;
        height: 45px !important;
      "
    >
      <div>
        <svg
          t="1707200352412"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6642"
          width="24"
          height="24"
        >
          <path
            d="M896 337.066667l123.733333-25.6-123.733333 136.533333z"
            fill="#4B369D"
            p-id="6643"
          ></path>
          <path
            d="M409.6 580.266667s187.733333-268.8 123.733333-328.533334-106.666667-34.133333-81.066666-64c25.6-29.866667 209.066667-76.8 405.333333 38.4s-59.733333 486.4-179.2 571.733334-358.4 196.266667-516.266667 170.666666-89.6-89.6-76.8-89.6 209.066667-98.133333 324.266667-298.666666z"
            fill="#A7ADFF"
            p-id="6644"
          ></path>
          <path
            d="M392.533333 332.8s-157.866667-42.666667-204.8-85.333333-85.333333-102.4-145.066666-93.866667C-25.6 162.133333 12.8 349.866667 106.666667 384s102.4 38.4 72.533333 72.533333-51.2 81.066667-8.533333 85.333334 51.2 4.266667 59.733333 51.2c4.266667 46.933333 76.8 21.333333 93.866667 38.4s51.2 110.933333 162.133333 76.8c106.666667-34.133333 162.133333-93.866667 157.866667-136.533334s-42.666667-153.6-251.733334-238.933333z"
            fill="#978CFF"
            p-id="6645"
          ></path>
          <path
            d="M776.533333 311.466667m-29.866666 0a29.866667 29.866667 0 1 0 59.733333 0 29.866667 29.866667 0 1 0-59.733333 0Z"
            fill="#4B369D"
            p-id="6646"
          ></path>
        </svg>
      </div>
      <div>
        <span style="font-style: oblique; font-weight: bold; font-size: 24px; font-family: fantasy"
          >Skill Info</span
        >
      </div>
    </div>
  </div>
  <div class="accountPmc_Card accountPmc_Card_row animate__animated animate__backInLeft">
    <div
      class="accountPmc_Card_P accountPmc_Card_P_Hideout setup_button_height"
      style="
        justify-content: flex-start;
        height: 30px !important;
        padding: 5px;
        margin: 3px;
        font-size: 12px;
      "
      @click="handelClick"
    >
      <div style="display: flex; align-items: flex-end; justify-content: space-between">
        <p style="color: #c4c4c4">《返回上一级</p>
        <p style="color: #c4c4c4">当前是技能菜单</p>
      </div>
    </div>
  </div>
  <div class="NeworldscroE" style="width: 100%; height: 540px">
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
    <div class="accountPmc_Card_P animate__animated animate__flipInX">
      <div class="P_card_hoad">
        <p>
          <span style="color: #c4c4c4">耐力</span>
        </p>
      </div>
      <div>
        <svg
          t="1706162118688"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6938"
          width="34"
          height="34"
        >
          <path
            d="M652.117 246.784c29.238 12.096 62.88 5.387 85.227-17.003s29.013-56.032 16.875-85.248c-12.139-29.216-40.694-48.234-72.32-48.181a78.025 78.025 0 0 0-55.243 22.912 78.079 78.079 0 0 0-22.827 55.285c-0.01 31.616 19.062 60.139 48.288 72.235z"
            p-id="6939"
          ></path>
          <path
            d="M877.547 221.877c-60.246 78.432-162.528 92.886-249.515 44.939-6.027-3.253-32.288-16.619-38.07-19.872-139.989-76.981-279.743-46.87-373.482 74.933-39.872 51.808 52.288 100.843 91.69 49.643 48.193-62.89 109.995-81.077 177.345-61.205-34.454 55.541-64.576 110.72-107.104 189.152-42.528 78.432-136.619 140.96-226.859 91.914-65.173-35.178-123.968 51.563-59.03 86.742 114.337 60.928 255.52 35.69 341.675-61.078a55.339 55.339 0 0 0 8.192 3.371c60.246 19.52 139.275 71.328 163.371 89.76 24.096 18.432 65.419 111.925 89.995 158.912 29.76 57.11 126.016 15.541 96.384-41.803-27.467-53.376-74.816-159.754-111.798-186.741a923.493 923.493 0 0 0-134.09-84.33A5547.449 5547.449 0 0 1 648.896 382.72c113.845 32.288 222.037-5.781 299.019-105.781 39.872-51.808-30.976-106.262-70.368-55.062zM352.533 863.66h-192c-17.674 0-32 14.325-32 32s14.326 32 32 32h192c17.675 0 32-14.326 32-32s-14.325-32-32-32z"
            p-id="6940"
          ></path>
          <path
            d="M416.533 749.525h-192c-17.674 0-32 14.326-32 32s14.326 32 32 32h192c17.675 0 32-14.325 32-32s-14.325-32-32-32z"
            p-id="6941"
          ></path>
        </svg>
      </div>
      <div style="margin-top: 5px">
        <p><span style="color: #c4c4c4">经验进度条</span></p>
        <p>
          <n-slider :min="0" :max="17206065" disabled></n-slider>
        </p>
        <p><span style="color: #c4c4c4">经验上限</span></p>
        <p>
          <n-input-number step="0.01"></n-input-number>
        </p>
      </div>
    </div>
  </div>
</template>

<style scoped>
.NeworldscroE {
  /* height: 430px; */
  overflow-y: auto;
}

.NeworldscroE::-webkit-scrollbar {
  /*滚动条整体样式*/
  width: 0px;
  /*高宽分别对应横竖滚动条的尺寸*/
  height: 0px;
}

.NeworldscroE::-webkit-scrollbar-thumb {
  /*滚动条里面小方块*/
  border-radius: 0px;
  -webkit-box-shadow: inset 0 0 5px rgba(235, 238, 240, 0.2);
  background: #ebeef0;
}

.NeworldscroE::-webkit-scrollbar-track {
  /*滚动条里面轨道*/
  -webkit-box-shadow: inset 0 0 5px rgba(235, 238, 240, 0.2);
  border-radius: 0px;
  background: #f1f6fa;
}
.accountPmc_Card_layout {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  justify-content: flex-start;
  align-items: center;

  /* margin: 0 10px; */
}
.accountPmc_Card_P {
  width: 325px;
  height: 200px;
  background-color: rgb(39, 39, 39);
  border: 1px solid rgb(28, 28, 28);
  border-radius: 5px;
  margin: 5px;
  margin-bottom: 10px;
  cursor: pointer;
  flex: 1 1 auto;
  padding: 10px;
  text-align: center;
  transition:
    transform 0.3s,
    box-shadow 0.3s !important;
}
.accountPmc_Card_P:hover {
  /* box-shadow: 0 16px 32px 0 rgba(48, 55, 66, 0.15); */

  /* transition-delay: 0s !important; */
  /* border: 1px solid #78a4fa; */

  /* transform: translateY(-10px)  !important; */
  box-shadow: 0 0 10px rgba(255, 255, 255, 0.3);
  /* animation: sparkle 0.5s infinite; */
}
.setup_button_height {
  height: 55px !important;
}
.accountPmc_Card_P_Hideout {
  height: 40px !important;
}
.accountPmc_Card_row {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  justify-content: flex-start;
  align-items: center;
}
.accountPmc_Card {
  margin-top: 3px;
  flex: 1 1 auto;
}
.div2_Layout {
  flex: 1 0 100%;
  padding: 5px;
  background-color: #1c1c1c;
  border-top-left-radius: 5px;
  color: #eaeaea;
}
</style>
